Revit 2027 API
RailingSlopeOption Enumeration
 The option determines the slope of the railing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailingSlopeOption
Public Enumeration RailingSlopeOption
public enum class RailingSlopeOption
type RailingSlopeOption
Members
Member name | Value | Description
ByHost | 0 |  The slope of the railing is determined by its host.
Flat | 1 |  The slope of the railing will be kept flat.
Sloped | 2 |  The slope of the railing will be specified by users.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace